package Chapter06.EX01;

public class Using_Class01 {

	public static void main(String[] args) {
		//절차지향형 프로그램 : C언어, 시간의 순서에 따라서 프로그래밍 하는 방식
			// ex) 한 공장에서 모든 제품을 완성시키는 것, 성능이 좋고 제작하기 어렵다. 
			// 만약 고장이 난다면 생산된 공장에서만 수리할 수 있고 수리하기 위해 제품을 모두 분해해서 다시 제작해야함.
		
		//객체지향형 프로그램 (OOP) : java, 프로그램을 객체, 객체, 객체로 나눔 
			// ex) 제품을 부품을 표준화하여 부품1, 부품2, 부품3.. 등 부품을 각각 만들어 조립하는 형식
			//		객체를 조립하는 형식으로 제품을 완료. 제작하기 굉장히 쉽고 수리하기 쉽다.
			// 고장이 난다면 해당 제품만 교체하면 됨.
		
		
		//1. 클래스 내부의 요소들
		//	- 필드
	
		//	-생성자
	
		//	- 메소드
		
		//	- 이너클래스(내부 클래스)
		
		//2. 클래스 외부의 요소들
		//	- 패키지
		
		//	- 임포트
		
		//	- 외부 클래스
		
		
		
		
		
		
	}

}
